MS-28k-r-r-t1.log
28k_r_r: (g=0): rw=randread, bs=(R) 28.0KiB-28.0KiB, (W) 28.0KiB-28.0KiB, (T) 28.0KiB-28.0KiB, ioengine=libaio, iodepth=32
...
fio-3.25-15-gced2
Starting 8 processes
28k_r_r: Laying out IO file (1 file / 102400MiB)
28k_r_r: Laying out IO file (1 file / 102400MiB)
28k_r_r: Laying out IO file (1 file / 102400MiB)
[...]

28k_r_r: (groupid=0, jobs=8): err= 0: pid=32090: Fri Dec 25 11:29:49 2020
  read: IOPS=137k, BW=3751MiB/s (3933MB/s)(440GiB/120019msec)
    slat (usec): min=2, max=102, avg= 5.84, stdev= 2.92
    clat (usec): min=44, max=48143, avg=1856.63, stdev=5358.01
     lat (usec): min=64, max=48147, avg=1862.68, stdev=5357.98
    clat percentiles (usec):
     |  1.00th=[  110],  5.00th=[  127], 10.00th=[  137], 20.00th=[  151],
     | 30.00th=[  169], 40.00th=[  186], 50.00th=[  200], 60.00th=[  219],
     | 70.00th=[  247], 80.00th=[  306], 90.00th=[ 5080], 95.00th=[14091],
     | 99.00th=[27657], 99.50th=[31589], 99.90th=[38536], 99.95th=[40109],
     | 99.99th=[43254]
   bw (  MiB/s): min=    4, max= 3925, per=28.11%, avg=1054.41, stdev=64.47, samples=16465231
   iops        : min=    8, max=    8, avg= 8.00, stdev= 0.00, samples=16465231
  lat (usec)   : 50=0.01%, 100=0.32%, 250=70.23%, 500=15.54%, 750=0.42%
  lat (usec)   : 1000=0.23%
  lat (msec)   : 2=0.86%, 4=1.58%, 10=3.87%, 20=4.07%, 50=2.87%
  cpu          : usr=5.49%, sys=12.89%, ctx=13150512, majf=0, minf=644023
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=16464983,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=3751MiB/s (3933MB/s), 3751MiB/s-3751MiB/s (3933MB/s-3933MB/s), io=440GiB (472GB), run=120019-120019msec

Disk stats (read/write):
    md1: ios=24424049/5, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=6106012/1, aggrmerge=0/0, aggrticks=10843198/0, aggrin_queue=10860091, aggrutil=97.82%
  nvme1n1: ios=6103241/2, merge=0/0, ticks=10119462/0, in_queue=10138219, util=97.82%
  nvme3n1: ios=6105460/1, merge=0/0, ticks=6895115/0, in_queue=6904897, util=97.79%
  nvme5n1: ios=6105999/2, merge=0/0, ticks=11350497/0, in_queue=11367237, util=97.80%
  nvme7n1: ios=6109349/0, merge=0/0, ticks=15007720/0, in_queue=15030011, util=97.80%